import React from "react";
import { useNavigate } from "react-router-dom";

const MainPage = () => {
  return (
    <div>
      <h1>
        хочу отметить, что 90% сделал сам, ИИ использовал только для решения
        ошибок синтаксис и прочие ошибки <br />
        Сделал пагинацию, добавил карзину, которая может прятаться по нажатию на
        карзину, есть возможность удалять покемонов с корзины Арена простая, там
        суммируются характеристики и далее сравнения и укого меньше, тот
        проиграл Сделал визуальную часть того, как проигрывает покемон. Было
        сложно, в конце показалось, что код простой. хотелось улучшить Арену, но
        сил не хватило, надеюсь на ваше понимание, увидимся через месяц, приду
        подготовленным!!!
      </h1>
    </div>
  );
};

export default MainPage;
